UTAF_Base/requestFiles/PTS_FindOrganisation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1"
	xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1"
	xmlns:v3="http://api.web.bc/capability/business/b182/services/organisation/v3"
	xmlns:v21="http://api.web.bc/capability/business/b182/objects/requestfindorganisation/v2">
	<soapenv:Header>
		<v2:CommonContextRequest>
			<v2:transaction>
				<v1:messageId>${Req_corrId}</v1:messageId>
				<v1:conversationId>${Req_conversationId}</v1:conversationId>
				<v1:dateTimeCreated>${Req_dateTimeCreated}</v1:dateTimeCreated>
			</v2:transaction>
			<v2:consumerTransaction>
				<v11:businessTransactionId>${Req_corrId}</v11:businessTransactionId>
				<v11:dateTimeCreated>${Req_dateTimeCreated}</v11:dateTimeCreated>
			</v2:consumerTransaction>
		</v2:CommonContextRequest>
	</soapenv:Header>
	<soapenv:Body>
		<v3:RequestDataFindOrganisation
			version="3.0">
			<v3:serviceContext>
				<v3:nameFindMethod>
					<v21:value>${Req_nameFindMethod}</v21:value>
				</v3:nameFindMethod>
				<v3:transactionData>
					<v3:endUserLanguage>EN</v3:endUserLanguage>
					<v3:consumerApplication>CDB</v3:consumerApplication>
				</v3:transactionData>
			</v3:serviceContext>
			<v3:serviceData>
				<v3:criteria>
					<v3:organisationName>
						<v21:legalName>${Req_legalName}</v21:legalName>
					</v3:organisationName>
					<v3:VATNumber>
						<v21:VATNumber>${Req_VATNumber}</v21:VATNumber>
						<v21:countryCode>
							<v21:alpha2Code>${Req_countryCode}</v21:alpha2Code>
						</v21:countryCode>
					</v3:VATNumber>
					<v3:partyRole>
						<v3:customerIdentifier>
							<v21:id>${Req_customerIdentifier}</v21:id>
							<v21:idScope>
								<v21:value>${Req_customerIdentifier_idScope}</v21:value>
							</v21:idScope>
							<v21:idContext>
								<v21:value>${Req_customerIdentifier_idContext}</v21:value>
							</v21:idContext>
						</v3:customerIdentifier>
					</v3:partyRole>
				</v3:criteria>
			</v3:serviceData>
		</v3:RequestDataFindOrganisation>
	</soapenv:Body>
</soapenv:Envelope>
